code/openfoam/tutorials/incompressibleFluid/TJunctionFan/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fan
{
    type        surface;

    surface     plate;
    origin      (0.1 -0.006 0.004);
    span        (0 0.012 0.012);
}

baffle
{
    type        difference;

    plane
    {
        type        plane;
        point       (0.1 0 0);
        normal      (1 0 0);
    }

    fan;
}

// ************************************************************************* //
